balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF1527.PIC
        <edc:AdjustPoint edc:offset="3"/>
        <edc:JoinedSFRDef edc:cname="CCPR1" edc:desc="" edc:name="CCPR1" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR1L" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR1L" edc:desc="" edc:mask="0xff" edc:name="CCPR1L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR1H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR1H" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR1H" edc:desc="" edc:mask="0xff" edc:name="CCPR1H" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCP1CON" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CCP1CON" edc:nzwidth="0x8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP1M" edc:desc="" edc:mask="0xf" edc:name="CCP1M" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DC1B" edc:desc="" edc:mask="0x3" edc:name="DC1B" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP1M0" edc:desc="" edc:mask="0x1" edc:name="CCP1M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1M1" edc:desc="" edc:mask="0x1" edc:name="CCP1M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1M2" edc:desc="" edc:mask="0x1" edc:name="CCP1M2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1M3" edc:desc="" edc:mask="0x1" edc:name="CCP1M3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC1B0" edc:desc="" edc:mask="0x1" edc:name="DC1B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC1B1" edc:desc="" edc:mask="0x1" edc:name="DC1B1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:JoinedSFRDef edc:cname="CCPR2" edc:desc="" edc:name="CCPR2" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR2L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR2L" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR2L" edc:desc="" edc:mask="0xff" edc:name="CCPR2L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR2H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR2H" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR2H" edc:desc="" edc:mask="0xff" edc:name="CCPR2H" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCP2CON" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CCP2CON" edc:nzwidth="0x8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP2M" edc:desc="" edc:mask="0xf" edc:name="CCP2M" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DC2B" edc:desc="" edc:mask="0x3" edc:name="DC2B" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP2M0" edc:desc="" edc:mask="0x1" edc:name="CCP2M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2M1" edc:desc="" edc:mask="0x1" edc:name="CCP2M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2M2" edc:desc="" edc:mask="0x1" edc:name="CCP2M2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2M3" edc:desc="" edc:mask="0x1" edc:name="CCP2M3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC2B0" edc:desc="" edc:mask="0x1" edc:name="DC2B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC2B1" edc:desc="" edc:mask="0x1" edc:name="DC2B1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPTMRS0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CCPTMRS0" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C1TSEL" edc:desc="" edc:mask="0x3" edc:name="C1TSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="C2TSEL" edc:desc="" edc:mask="0x3" edc:name="C2TSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="C3TSEL" edc:desc="" edc:mask="0x3" edc:name="C3TSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="C4TSEL" edc:desc="" edc:mask="0x3" edc:name="C4TSEL" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C1TSEL0" edc:desc="" edc:mask="0x1" edc:name="C1TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1TSEL1" edc:desc="" edc:mask="0x1" edc:name="C1TSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2TSEL0" edc:desc="" edc:mask="0x1" edc:name="C2TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2TSEL1" edc:desc="" edc:mask="0x1" edc:name="C2TSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3TSEL0" edc:desc="" edc:mask="0x1" edc:name="C3TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3TSEL1" edc:desc="" edc:mask="0x1" edc:name="C3TSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4TSEL0" edc:desc="" edc:mask="0x1" edc:name="C4TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4TSEL1" edc:desc="" edc:mask="0x1" edc:name="C4TSEL1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPTMRS1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CCPTMRS1" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C5TSEL" edc:desc="" edc:mask="0x3" edc:name="C5TSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="C6TSEL" edc:desc="" edc:mask="0x3" edc:name="C6TSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="C7TSEL" edc:desc="" edc:mask="0x3" edc:name="C7TSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="C8TSEL" edc:desc="" edc:mask="0x3" edc:name="C8TSEL" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C5TSEL0" edc:desc="" edc:mask="0x1" edc:name="C5TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C5TSEL1" edc:desc="" edc:mask="0x1" edc:name="C5TSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C6TSEL0" edc:desc="" edc:mask="0x1" edc:name="C6TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C6TSEL1" edc:desc="" edc:mask="0x1" edc:name="C6TSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C7TSEL0" edc:desc="" edc:mask="0x1" edc:name="C7TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C7TSEL1" edc:desc="" edc:mask="0x1" edc:name="C7TSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C8TSEL0" edc:desc="" edc:mask="0x1" edc:name="C8TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C8TSEL1" edc:desc="" edc:mask="0x1" edc:name="C8TSEL1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CCPTMRS2" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----xxxx" edc:name="CCPTMRS2" edc:nzwidth="8" edc:por="----xxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C9TSEL" edc:desc="" edc:mask="0x3" edc:name="C9TSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="C10TSEL" edc:desc="" edc:mask="0x3" edc:name="C10TSEL" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C9TSEL0" edc:desc="" edc:mask="0x1" edc:name="C9TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C9TSEL1" edc:desc="" edc:mask="0x1" edc:name="C9TSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C10TSEL0" edc:desc="" edc:mask="0x1" edc:name="C10TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C10TSEL1" edc:desc="" edc:mask="0x1" edc:name="C10TSEL1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="6" edc:beginaddr="0x300" edc:endaddr="0x320" edc:regionid="sfr6">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TRISF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="TRISF" edc:nzwidth="8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISF0" edc:desc="" edc:mask="0x1" edc:name="TRISF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISF1" edc:desc="" edc:mask="0x1" edc:name="TRISF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISF2" edc:desc="" edc:mask="0x1" edc:name="TRISF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISF3" edc:desc="" edc:mask="0x1" edc:name="TRISF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISF4" edc:desc="" edc:mask="0x1" edc:name="TRISF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISF5" edc:desc="" edc:mask="0x1" edc:name="TRISF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISF6" edc:desc="" edc:mask="0x1" edc:name="TRISF6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISF7" edc:desc="" edc:mask="0x1" edc:name="TRISF7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
